Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio.c
static void _stm32_sdio_enable_irq(const SD_TypeDef* instance, uint32_t priority, bool en_irq);
static void _stm32_sdio_enable_hw_block(cyhal_sdio_t* obj);
static void _stm32_sdio_disable_hw_block(const cyhal_sdio_t* obj);
static uint32_t _stm32_safe_divide(uint32_t num, uint32_t denom);


/***************************************************************************************************
 * stm32_cypal_sdio_hw_init
 **************************************************************************************************/
uint32_t stm32_cypal_sdio_hw_init(SD_HandleTypeDef* hsd)
{
    /* Check the parameters */
    assert_param(NULL != hsd);

    _cyhal_sdio_handle = hsd;
    return 0;
}


/***************************************************************************************************
 * cyhal_sdio_init
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_init(cyhal_sdio_t* obj, cyhal_gpio_t cmd, cyhal_gpio_t clk, cyhal_gpio_t data0,
                          cyhal_gpio_t data1, cyhal_gpio_t data2, cyhal_gpio_t data3)
{
    (void)cmd;
    (void)clk;
    (void)data0;
    (void)data1;
    (void)data2;
    (void)data3;
    uint32_t sdmmc_clk;

    /* Check the parameters */
    assert_param(NULL != obj);

    /* Update obj sd handle */
    obj->hsd = _cyhal_sdio_handle;

    /* Check the SD handle allocation */
    if (obj->hsd == NULL)
    {
        return (cy_rslt_t)HAL_ERROR;
    }

    if (cy_rtos_init_semaphore(&sdio_transfer_sema, 1, 0) != 0u)
    {
        (void)cy_rtos_deinit_semaphore(&sdio_transfer_sema);
        return (cy_rslt_t)HAL_ERROR;
    }

    /* Init the low level hardware : GPIO, CLOCK, CORTEX...etc */
    if (obj->hsd->State == HAL_SD_STATE_RESET)
    {
        /* Allocate lock resource and initialize it */
        obj->hsd->Lock = HAL_UNLOCKED;

        HAL_SD_MspInit(obj->hsd);
    }

    /* Default SDMMC peripheral configuration for initialization */
    obj->hsd->Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
    obj->hsd->Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    obj->hsd->Init.BusWide             = SDMMC_BUS_WIDE_4B;
    obj->hsd->Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;

    /* Init Clock should be less or equal to 400Khz */
    sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC);

    obj->hsd->Init.ClockDiv = _stm32_safe_divide(sdmmc_clk, 2U * _CYHAL_SDIO_400KHZ);
    obj->hsd->State         = HAL_SD_STATE_BUSY;

    /* Enable SDIO block */
    _stm32_sdio_enable_hw_block(obj);

    /* Initialize the error code */
    obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;

    /* store object in handle context */
    obj->hsd->Context = (uint32_t)obj;

    /* Initialize the SD state */
    obj->hsd->State = HAL_SD_STATE_READY;

    /* Enable interrupts */
    _stm32_sdio_enable_irq(obj->hsd->Instance, CYHAL_SDIO_IRQ_PRIORITY, true);
    return CY_RSLT_SUCCESS;
}


/***************************************************************************************************
 * cyhal_sdio_free
 **************************************************************************************************/
void cyhal_sdio_free(cyhal_sdio_t* obj)
{
    (void)obj;

    (void)cy_rtos_deinit_semaphore(&sdio_transfer_sema);
}


/***************************************************************************************************
 * cyhal_sdio_configure
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_configure(cyhal_sdio_t* obj, const cyhal_sdio_cfg_t* config)
{
    uint32_t clk_freq;

    /* Check the parameters */
    assert_param(NULL != obj);

    /* Update obj sd handle */
    if (obj->hsd == NULL)
    {
        obj->hsd = _cyhal_sdio_handle;
    }

    /* Do not change frequency if requested value is zero */
    if (config->frequencyhal_hz != 0u)
    {
        /* Override the SDMMC Clock frequency Configuration if defined */
        #ifdef SDMMC_CLK_FREQ_OVERRIDE
        clk_freq = SDMMC_CLK_FREQ_OVERRIDE;
        #else
        clk_freq = config->frequencyhal_hz;
        #endif
        obj->frequencyhal_hz = clk_freq;

        /* Calculate SDMMC Clock divider. */
        /* ClockDiv = SDMMC input clock / (2 * Expected SDMMC Clock) */
        uint32_t sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC);

        obj->hsd->Init.ClockDiv = _stm32_safe_divide(sdmmc_clk, 2U * clk_freq);

        /* Reset and Enable SDIO block */
        _stm32_sdio_enable_hw_block(obj);
    }

    /* Do not change block size if requested value is zero */
    if (config->block_size != 0u)
    {
        obj->block_size = config->block_size;
    }

    return CY_RSLT_SUCCESS;
}


/***************************************************************************************************
 * cyhal_sdio_send_cmd
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_send_cmd(cyhal_sdio_t* obj, cyhal_sdio_transfer_type_t direction,
                              cyhal_sdio_command_t command, uint32_t argument, uint32_t* response)
{
    (void)direction;

    uint32_t ret;

    /* Check the parameters */
    assert_param(obj != NULL);
    assert_param(obj->hsd != NULL);

    switch (command)
    {
        /* CMD0 */
        case CYHAL_SDIO_CMD_GO_IDLE_STATE:
            ret = SDMMC_CmdGoIdleState(obj->hsd->Instance);
            break;

        /* CMD3 */
        case CYHAL_SDIO_CMD_SEND_RELATIVE_ADDR:
        {
            uint16_t resp = 0u;
            assert_param(response != NULL);
            ret       = SDMMC_CmdSetRelAdd(obj->hsd->Instance, &resp);
            *response = resp;
            break;
        }

        /* CMD5 */
        case CYHAL_SDIO_CMD_IO_SEND_OP_COND:
            ret = _stm32_sdio_cmd_send_op_cond(obj->hsd->Instance);
            break;

        /* CMD7 */
        case CYHAL_SDIO_CMD_SELECT_CARD:
            ret = SDMMC_CmdSelDesel(obj->hsd->Instance, (uint64_t)argument << 16);
            break;

        /* CMD52 */
        case CYHAL_SDIO_CMD_IO_RW_DIRECT:
            /* this one already has  != NULL check inside */
            ret = _stm32_sdio_cmd_rw_direct(obj->hsd->Instance, argument, response);
            break;

        /* CMD53 */
        case CYHAL_SDIO_CMD_IO_RW_EXTENDED:
            /* this one already has  != NULL check inside */
            ret = _stm32_sdio_cmd_rw_extended(obj->hsd->Instance, argument, response);
            break;

        case CYHAL_SDIO_CMD_GO_INACTIVE_STATE:
        default:
            ret = CYHAL_SDIO_RSLT_ERR_BAD_PARAM;
            break;
    }

    return ret;
}


/***************************************************************************************************
 * cyhal_sdio_bulk_transfer
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_bulk_transfer(cyhal_sdio_t* obj, cyhal_sdio_transfer_type_t direction,
                                   uint32_t argument, const uint32_t* data, uint16_t length,
                                   uint32_t* response)
{
    cy_rslt_t result = CYHAL_SDIO_RSLT_CANCELED;
    CYHAL_ALIGN_DMA_BUFFER(static uint32_t  _temp_dma_buffer[_CYHAL_SDIO_DMA_BUFFER_SIZE]);

    /* Check data buffer if aligned on 32-bytes (needed for cache maintenance purpose),
     * and Length is multiple by block size. If NOT, use internal buffer for DMA */
    bool use_temp_dma_buffer = ((((uint32_t)data % _CYHAL_DMA_BUFFER_ALIGN_BYTES) != 0u) ||
                                ((length % obj->block_size) != 0u) ||
                                (direction == CYHAL_SDIO_XFER_TYPE_READ));

    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(0u != length);
    assert_param(!use_temp_dma_buffer || (length <= sizeof(_temp_dma_buffer)));

    SDMMC_DataInitTypeDef config;
    sdio_cmd_argument_t   arg = { .value = argument };

    uint32_t  retry_cycle = _CYHAL_SDIO_RW_RETRY_CYCLES;
    uint32_t  number_of_blocks;
    uint32_t  block_size;
    uint32_t* p_dma_buffer = NULL;

    if (obj->hsd->State == HAL_SD_STATE_READY)
    {
        if ((length == 0) || (length > sizeof(_temp_dma_buffer)))
        {
            return CYHAL_SDIO_BAD_ARGUMENT;
        }

