Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio.c
        /* Block size not initialized */
        if (obj->block_size == 0U)
        {
            obj->block_size = _CYHAL_SDIO_DATA_BLOCK_SIZE_64B;
        }

        if (length >= obj->block_size)
        {
            /* Block mode */
            block_size       = obj->block_size;
            number_of_blocks = (length + block_size - 1u) / block_size;
        }
        else
        {
            /* Byte mode */
            block_size       = _stm32_sdio_find_optimal_block_size(length);
            number_of_blocks = 1UL;
        }

        /* Set the CMD53 byte mode size to be the same as the block size */
        if (arg.cmd53.block_mode == 0U)
        {
            if (_stm32_sdio_find_optimal_block_size(arg.cmd53.count) <
                _CYHAL_SDIO_DATA_BLOCK_SIZE_512B)
            {
                arg.cmd53.count = _stm32_sdio_find_optimal_block_size(arg.cmd53.count);
            }
            else
            {
                arg.cmd53.count = 0u;
            }
        }

        obj->hsd->ErrorCode = HAL_SD_ERROR_NONE;
        obj->hsd->State     = HAL_SD_STATE_BUSY;

        do
        {
            /* Initialize data control register */
            obj->hsd->Instance->DCTRL = 0u;

            if (use_temp_dma_buffer)
            {
                /* Using internal buffer */
                p_dma_buffer = _temp_dma_buffer;

                if (direction == CYHAL_SDIO_XFER_TYPE_WRITE)
                {
                    /* Clean internal buffer and copy data */
                    (void)memcpy((void*)_temp_dma_buffer, (void*)data, length);
                }
            }
            else
            {
                /* Use app data buffer */
                p_dma_buffer = (uint32_t*)data;
            }

            /* Maintenance D-cache for DMA buffers */
            #if defined(_CYHAL_DCACHE_MAINTENANCE)
            if (direction == CYHAL_SDIO_XFER_TYPE_WRITE)
            {
                SCB_CleanDCache_by_Addr((uint32_t*)p_dma_buffer, block_size * number_of_blocks);
            }
            else
            {
                /* Cache-Invalidate the output from DMA */
                SCB_InvalidateDCache_by_Addr((uint32_t*)p_dma_buffer,
                                             length + __SCB_DCACHE_LINE_SIZE);
            }
            #endif /* if defined(_CYHAL_DCACHE_MAINTENANCE) */

            if ((uint32_t)p_dma_buffer & 0x3)
            {
                _CYHAL_SDIO_LOG("ERROR: Unaligned 4 byte buffers, buffer address 0x%x \n", data);
                _cyhal_sdio_handle->State = HAL_SD_STATE_READY;
                return CYHAL_SDIO_RET_NO_SP_ERRORS;
            }

            /* DMA configuration (use single buffer) */
            obj->hsd->Instance->IDMACTRL  = SDMMC_ENABLE_IDMA_SINGLE_BUFF;

            #if defined (TARGET_STM32U5xx)
            obj->hsd->Instance->IDMABASER = (uint32_t)p_dma_buffer;
            #else
            obj->hsd->Instance->IDMABASE0 = (uint32_t)p_dma_buffer;
            #endif

            /* Configure the SD DPSM (Data Path State Machine) */
            config.DataTimeOut = SDMMC_DATATIMEOUT;
            config.TransferDir = (direction == CYHAL_SDIO_XFER_TYPE_WRITE) ?
                                 SDMMC_TRANSFER_DIR_TO_CARD : SDMMC_TRANSFER_DIR_TO_SDMMC;
            config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
            config.DPSM          = SDMMC_DPSM_DISABLE;
            config.DataLength    = block_size * number_of_blocks;
            config.DataBlockSize = _stm32_sdio_convert_block_size((uint16_t)block_size);

            obj->hsd->Instance->DCTRL |= SDMMC_DCTRL_SDIOEN;  /* SD I/O enable functions */
            (void)SDMMC_ConfigData(obj->hsd->Instance, &config);

            __SDMMC_CMDTRANS_ENABLE(obj->hsd->Instance);

            /* Call CMD53 (CYHAL_SDIO_CMD_IO_RW_EXTENDED) */
            (void)cyhal_sdio_send_cmd(obj, direction, CYHAL_SDIO_CMD_IO_RW_EXTENDED,
                                      arg.value, NULL);

            /* Enable interrupt */
            obj->hsd->Instance->MASK |= SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | \
                                        SDMMC_IT_RXOVERR | SDMMC_IT_TXUNDERR |
                                        SDMMC_IT_DATAEND | SDMMC_ICR_SDIOITC;

            /* Wait for transfer complete */
            result = cy_rtos_get_semaphore(&sdio_transfer_sema, _CYHAL_SDIO_TRANSFER_SEMA_TIMEOUT,
                                           false);
            if (result != CY_RSLT_SUCCESS)
            {
                _CYHAL_SDIO_LOG("ERROR: cyhal_sdio_bulk_transfer: timeout \n");
                result = CYHAL_SDIO_RET_CMD_TIMEOUT;
            }
            else
            {
                if ((obj->hsd->Instance->STA & SDMMC_ERROR_MASK) != 0)
                {
                    _CYHAL_SDIO_LOG("ERROR: cyhal_sdio_bulk_transfer: detect error flag "
                                    "in SDMMC status register: %x \n", obj->hsd->Instance->STA);
                    result =  CYHAL_SDIO_RET_NO_SP_ERRORS;
                }

                if (response != NULL)
                {
                    *response = obj->hsd->Instance->RESP1;
                }
            }

            /* Wait Command/Data path state machine complete operation */
            uint32_t timeout = _CYHAL_SDIO_TX_RX_COMPLETE_TIMEOUT;
            do
            {
                timeout--;
                if ((timeout == 0u) || ((obj->hsd->Instance->STA & SDMMC_ERROR_MASK) != 0))
                {
                    _CYHAL_SDIO_LOG("ERROR: cyhal_sdio_bulk_transfer: waiting "
                                    "Command/Data path state machine active returns "
                                    "error: %x [%u]\n", obj->hsd->Instance->STA, timeout);
                    result = CYHAL_SDIO_RET_NO_SP_ERRORS;
                }
            } while (((obj->hsd->Instance->STA & (SDMMC_STA_CPSMACT | SDMMC_STA_DPSMACT)) != 0) &&
                     (result == CY_RSLT_SUCCESS));

            /* Set SDIO to init state */
            __HAL_SD_DISABLE_IT(obj->hsd, SDMMC_IT_IDMABTC);
            __SDMMC_CMDTRANS_DISABLE(obj->hsd->Instance);

            obj->hsd->Instance->DLEN     = 0;
            obj->hsd->Instance->DCTRL    = SDMMC_DCTRL_SDIOEN;
            obj->hsd->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
            obj->hsd->Instance->CMD      = 0;
            obj->hsd->Instance->DCTRL   |= SDMMC_DCTRL_FIFORST;

            /* Clear all the static flags */
            __HAL_SD_CLEAR_FLAG(obj->hsd, SDMMC_STATIC_DATA_FLAGS);

            retry_cycle--;
        } while (retry_cycle && (result != CY_RSLT_SUCCESS));

        /* Copy received data to user */
        if ((direction == CYHAL_SDIO_XFER_TYPE_READ) && (result == CY_RSLT_SUCCESS))
        {
            #if defined(_CYHAL_DCACHE_MAINTENANCE)
            SCB_CleanInvalidateDCache_by_Addr(
                (uint32_t*)((uint32_t)_temp_dma_buffer & ~(__SCB_DCACHE_LINE_SIZE - 1U)),
                length + __SCB_DCACHE_LINE_SIZE);
            #endif /* if defined(_CYHAL_DCACHE_MAINTENANCE) */

            (void)memcpy((void*)data, (void*)_temp_dma_buffer, (size_t)length);
        }

        /* Set the SD state to ready to be able to start again the process */
        _cyhal_sdio_handle->State = HAL_SD_STATE_READY;

        /* This interrupt is disabled in interrupt handler so need to enable it here */
        if (0U != ((uint32_t)CYHAL_SDIO_CARD_INTERRUPT & obj->irq))
        {
            __HAL_SD_ENABLE_IT(obj->hsd, SDMMC_IT_SDIOIT);
        }
    }
    else
    {
        obj->hsd->ErrorCode |= HAL_SD_ERROR_BUSY;
        return CYHAL_SDIO_RSLT_ERR_PM_PENDING;
    }

    return result;
}


/***************************************************************************************************
 * cyhal_sdio_register_callback
 **************************************************************************************************/
void cyhal_sdio_register_callback(cyhal_sdio_t* obj, cyhal_sdio_event_callback_t callback,
                                  void* callback_arg)
{
    /* Check the parameters */
    assert_param(NULL != obj);
    assert_param(NULL != callback);

