Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio.c
    /* Store callback info */
    obj->callback     = (void*)callback;
    obj->callback_arg = callback_arg;
}


/***************************************************************************************************
 * cyhal_sdio_enable_event
 **************************************************************************************************/
void cyhal_sdio_enable_event(cyhal_sdio_t* obj, cyhal_sdio_event_t event, uint8_t intr_priority,
                             bool enable)
{
    (void)intr_priority;
    if (enable)
    {
        __HAL_SD_ENABLE_IT(obj->hsd, SDMMC_IT_SDIOIT);
        obj->irq |= (uint32_t)event;
    }
    else
    {
        __HAL_SD_DISABLE_IT(obj->hsd, SDMMC_IT_SDIOIT);
        obj->irq &= ~(uint32_t)event;
    }
}


/***************************************************************************************************
 * cyhal_sdio_set_io_voltage
 **************************************************************************************************/
cy_rslt_t cyhal_sdio_set_io_voltage(cyhal_sdio_t* obj, cyhal_gpio_t io_volt_sel,
                                    cyhal_sdio_io_voltage_t io_voltage,
                                    cyhal_sdio_io_volt_action_type_t io_switch_type)
{
    (void)obj;
    (void)io_volt_sel;
    (void)io_voltage;
    (void)io_switch_type;
    return CYHAL_SDIO_RSLT_ERR_UNSUPPORTED;
}


/***************************************************************************************************
 * stm32_cyhal_sdio_irq_handler
 **************************************************************************************************/
void stm32_cyhal_sdio_irq_handler(void)
{
    uint32_t sta_reg = _cyhal_sdio_handle->Instance->STA;
    cyhal_sdio_t* obj = (cyhal_sdio_t*)_cyhal_sdio_handle->Context;

    if ((_cyhal_sdio_handle != NULL) &&
        (__HAL_SD_GET_FLAG(_cyhal_sdio_handle, SDMMC_STA_SDIOIT) != RESET))
    {
        ((cyhal_sdio_event_callback_t)obj->callback)(obj->callback_arg,
                                                     CYHAL_SDIO_CARD_INTERRUPT);

        /* Clear the interrupt */
        __HAL_SD_CLEAR_FLAG(_cyhal_sdio_handle, SDMMC_FLAG_SDIOIT);

        /* Mask interrupt, to be unmasked later by Tx Path */
        __HAL_SD_DISABLE_IT(_cyhal_sdio_handle, SDMMC_IT_SDIOIT);

        /* Set IRQ Flag which will be used for setting IRQ MASK back */
        obj->irq |= (uint32_t)CYHAL_SDIO_CARD_INTERRUPT;
    }

    if ((sta_reg & (SDMMC_STA_CCRCFAIL | SDMMC_STA_DCRCFAIL |
                    SDMMC_STA_TXUNDERR | SDMMC_STA_RXOVERR)) != 0)
    {
        _cyhal_sdio_handle->ErrorCode = sta_reg;
        _cyhal_sdio_handle->Instance->ICR = (uint32_t)0xffffffffu;
        (void)cy_rtos_set_semaphore(&sdio_transfer_sema, true);
    }
    else
    {
        if ((sta_reg & (SDMMC_STA_CMDREND | SDMMC_STA_CMDSENT)) != 0)
        {
            if ((_cyhal_sdio_handle->Instance->RESP1 & 0x800) != 0)
            {
                _cyhal_sdio_handle->ErrorCode = sta_reg;
                (void)cy_rtos_set_semaphore(&sdio_transfer_sema, true);
            }

            /* Clear all command/response interrupts */
            _cyhal_sdio_handle->Instance->ICR = (SDMMC_STA_CMDREND | SDMMC_STA_CMDSENT);
        }

        if (sta_reg & SDMMC_STA_DATAEND)
        {
            _cyhal_sdio_handle->Instance->ICR      = SDMMC_STA_DATAEND;
            _cyhal_sdio_handle->Instance->DLEN     = 0;
            _cyhal_sdio_handle->Instance->DCTRL    = SDMMC_DCTRL_SDIOEN;
            _cyhal_sdio_handle->Instance->IDMACTRL = SDMMC_DISABLE_IDMA;
            _cyhal_sdio_handle->Instance->CMD      = 0;
            (void)cy_rtos_set_semaphore(&sdio_transfer_sema, true);
        }
    }
}


/***************************************************************************************************
 * Private Functions
 **************************************************************************************************/

/***************************************************************************************************
 * _stm32_safe_divide
 **************************************************************************************************/
static uint32_t _stm32_safe_divide(uint32_t num, uint32_t denom)
{
    /* Safe divide */
    uint32_t divres;

    assert_param(num != 0u);
    assert_param(denom != 0u);
    divres = num / denom;
    if ((num % denom) >= (denom >> 1))
    {
        divres++;
    }
    return divres;
}


/***************************************************************************************************
 * _stm32_sdio_enable_hw_block
 **************************************************************************************************/
static void _stm32_sdio_enable_hw_block(cyhal_sdio_t* obj)
{
    uint32_t sdmmc_clk;

    /* Disable/reset SDIO Block */
    _stm32_sdio_disable_hw_block(obj);

    /* Enable the SDIO Clock */
    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_CLK_ENABLE();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_CLK_ENABLE();
    }
    #endif

    /* Initialize SDMMC peripheral interface with default configuration */
    (void)SDMMC_Init(obj->hsd->Instance, obj->hsd->Init);

    /* Set Power State to ON */
    (void)SDMMC_PowerState_ON(obj->hsd->Instance);

    /* Wait clock */
    (void)SDMMC_SetSDMMCReadWaitMode(obj->hsd->Instance, SDMMC_READ_WAIT_MODE_CLK);

    if (obj->hsd->Init.ClockDiv != 0)
    {
        sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC) /
                    (2U * obj->hsd->Init.ClockDiv);
    }
    else
    {
        sdmmc_clk = HAL_RCCEx_GetPeriphCLKFreq(STM32_RCC_PERIPHCLK_SDMMC);
    }

    if (sdmmc_clk != 0U)
    {
        /* Wait 74 Cycles: required power up waiting time
         * before starting the SD initialization sequence */
        HAL_Delay(1U + (74U * 1000U / (sdmmc_clk)));
    }
    else
    {
        HAL_Delay(2U);
    }
}


/***************************************************************************************************
 * _stm32_sdio_disable_hw_block
 **************************************************************************************************/
static void _stm32_sdio_disable_hw_block(const cyhal_sdio_t* obj)
{
    /* Reset SDIO Block */
    (void)SDMMC_PowerState_OFF(obj->hsd->Instance);
    #if defined (SDMMC1)
    if (obj->hsd->Instance == SDMMC1)
    {
        __HAL_RCC_SDMMC1_FORCE_RESET();
        __HAL_RCC_SDMMC1_RELEASE_RESET();
    }
    #endif
    #if defined (SDMMC2)
    else
    {
        __HAL_RCC_SDMMC2_FORCE_RESET();
        __HAL_RCC_SDMMC2_RELEASE_RESET();
    }
    #endif
}


/***************************************************************************************************
 * _stm32_sdio_find_optimal_block_size
 **************************************************************************************************/
static  uint32_t _stm32_sdio_find_optimal_block_size(uint32_t data_size)
{
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_256B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_512B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_128B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_256B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_64B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_128B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_32B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_64B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_16B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_32B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_8B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_16B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_4B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_8B;
    }
    if (data_size > (uint32_t)_CYHAL_SDIO_DATA_BLOCK_SIZE_2B)
    {
        return _CYHAL_SDIO_DATA_BLOCK_SIZE_4B;
    }
    return _CYHAL_SDIO_DATA_BLOCK_SIZE_4B;
}


/***************************************************************************************************
 * _stm32_sdio_convert_block_size
 **************************************************************************************************/
static uint32_t _stm32_sdio_convert_block_size(uint16_t block_size)
{
    switch (block_size)
    {
        case 1:
            return SDMMC_DATABLOCK_SIZE_1B;

