Infineon/AIROC-Wi-Fi-Bluetooth-STM32/Middlewares/Third_Party/pal/targets/TARGET_STM32/Src/stm32_cyhal_sdio.c
        case 2:
            return SDMMC_DATABLOCK_SIZE_2B;

        case 4:
            return SDMMC_DATABLOCK_SIZE_4B;

        case 8:
            return SDMMC_DATABLOCK_SIZE_8B;

        case 16:
            return SDMMC_DATABLOCK_SIZE_16B;

        case 32:
            return SDMMC_DATABLOCK_SIZE_32B;

        case 64:
            return SDMMC_DATABLOCK_SIZE_64B;

        case 128:
            return SDMMC_DATABLOCK_SIZE_128B;

        case 256:
            return SDMMC_DATABLOCK_SIZE_256B;

        case 512:
            return SDMMC_DATABLOCK_SIZE_512B;

        case 1024:
            return SDMMC_DATABLOCK_SIZE_1024B;

        case 2048:
            return SDMMC_DATABLOCK_SIZE_2048B;

        case 4096:
            return SDMMC_DATABLOCK_SIZE_4096B;

        case 8192:
            return SDMMC_DATABLOCK_SIZE_8192B;

        case 16384:
            return SDMMC_DATABLOCK_SIZE_16384B;

        default:
            assert_param(false); /* wrong value */
            return SDMMC_DATABLOCK_SIZE_512B;
    }
}


/***************************************************************************************************
 * _stm32_sdio_enable_irq
 **************************************************************************************************/
static void _stm32_sdio_enable_irq(const SD_TypeDef* instance, uint32_t priority, bool en_irq)
{
    IRQn_Type IRQn = (IRQn_Type)0;

    #if defined (SDMMC1)
    if (instance == SDMMC1)
    {
        IRQn = SDMMC1_IRQn;
    }
    else
    #endif

    #if defined (SDMMC2)
    if (instance == SDMMC2)
    {
        IRQn = SDMMC2_IRQn;
    }
    else
    #endif
    {
        assert_param(false); /* wrong instance */
    }

    if (en_irq)
    {
        HAL_NVIC_SetPriority(IRQn, priority, 0);
        HAL_NVIC_EnableIRQ(IRQn);
    }
    else
    {
        HAL_NVIC_DisableIRQ(IRQn);
    }
}


/***************************************************************************************************
 * _stm32_sdio_get_cmd_resp4
 **************************************************************************************************/
static uint32_t _stm32_sdio_get_cmd_resp4(SDMMC_TypeDef* SDMMCx)
{
    uint32_t sta_reg;
    /* 8 is the number of required instructions cycles for the below loop statement.
       The SDMMC_CMDTIMEOUT is expressed in ms */
    uint32_t count = _CYHAL_SDIO_CMD_TIMEOUT * (SystemCoreClock / 8U /1000U);

    do
    {
        if (count-- == 0U)
        {
            return SDMMC_ERROR_TIMEOUT;
        }
        sta_reg = SDMMCx->STA;
    } while(((sta_reg & (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT)) == 0U) ||
            ((sta_reg & SDMMC_FLAG_CMDACT) != 0U));

    if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
    {
        __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

        return SDMMC_ERROR_CMD_RSP_TIMEOUT;
    }
    else
    {
        /* Clear all the static flags */
        __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);
    }

    return SDMMC_ERROR_NONE;
}


/***************************************************************************************************
 * _stm32_sdio_cmd_send_op_cond
 **************************************************************************************************/
static uint32_t _stm32_sdio_cmd_send_op_cond(SDMMC_TypeDef* SDMMCx)
{
    SDMMC_CmdInitTypeDef sdmmc_cmdinit;
    uint32_t             errorstate;

    sdmmc_cmdinit.Argument         = 0U;
    sdmmc_cmdinit.CmdIndex         = SDMMC_CMD_SDMMC_SEN_OP_COND;
    sdmmc_cmdinit.Response         = SDMMC_RESPONSE_SHORT;
    sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
    sdmmc_cmdinit.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

    /* Check for error conditions */
    errorstate = _stm32_sdio_get_cmd_resp4(SDMMCx);

    return errorstate;
}


/***************************************************************************************************
 * _stm32_sdio_get_cmd_resp5
 **************************************************************************************************/
static uint32_t _stm32_sdio_get_cmd_resp5(SDMMC_TypeDef* SDMMCx, uint8_t SD_CMD, uint32_t* data,
                                          uint32_t argument)
{
    uint32_t response_r1;
    uint32_t sta_reg;
    uint32_t count;
    sdio_cmd_argument_t arg = { .value = argument };

    if (arg.cmd52.register_address == _CYHAL_SDIO_SLEEP_CSR)
    {
        /* In case of 43012 chip, the chip could go down immediately after KSO bit is cleared.
         * So the further reads of KSO register could fail. WHD skip check return values
         * for SDIO_SLEEP_CSR command, here we decrease common command timeout, to prevent blocking
         * of
         * WHD thread for long time */
        count = _CYHAL_SDIO_SLEEP_CSR_CMD_TIMEOUT * (SystemCoreClock / 8U /1000U);
    }
    else
    {
        /* 8 is the number of required instructions cycles for the below loop statement.
           The _CYHAL_SDIO_CMD_TIMEOUT is expressed in ms */
        count = _CYHAL_SDIO_CMD_TIMEOUT * (SystemCoreClock / 8U /1000U);
    }

    do
    {
        if (count-- == 0U)
        {
            return SDMMC_ERROR_TIMEOUT;
        }
        sta_reg = SDMMCx->STA;
    } while(((sta_reg & (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT)) == 0U) ||
            ((sta_reg & SDMMC_FLAG_CMDACT) != 0U));

    if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT))
    {
        __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CTIMEOUT);

        return SDMMC_ERROR_CMD_RSP_TIMEOUT;
    }
    else if (__SDMMC_GET_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL))
    {
        __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_FLAG_CCRCFAIL);

        return SDMMC_ERROR_CMD_CRC_FAIL;
    }
    else
    {
        /* Nothing to do */
    }

    /* Check response received is of desired command */
    if (SDMMC_GetCommandResponse(SDMMCx) != SD_CMD)
    {
        return SDMMC_ERROR_CMD_CRC_FAIL;
    }

    /* Clear all the static flags */
    __SDMMC_CLEAR_FLAG(SDMMCx, SDMMC_STATIC_CMD_FLAGS);

    /* We have received response, retrieve it.  */
    response_r1 = SDMMC_GetResponse(SDMMCx, SDMMC_RESP1);

    if ((response_r1 & SDMMC_R5_ERRORBITS) == SDMMC_ALLZERO)
    {
        if (data != NULL)
        {
            *data = response_r1;
        }
        return SDMMC_ERROR_NONE;
    }
    else if ((response_r1 & SDMMC_R5_COM_CRC_ERROR) == SDMMC_R5_COM_CRC_ERROR)
    {
        return SDMMC_ERROR_COM_CRC_FAILED;
    }
    else if ((response_r1 & SDMMC_R5_ILLEGAL_COMMAND) == SDMMC_R5_ILLEGAL_COMMAND)
    {
        return SDMMC_ERROR_ILLEGAL_CMD;
    }
    else if ((response_r1 & SDMMC_R5_ERROR) == SDMMC_R5_ERROR)
    {
        return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
    }
    else if ((response_r1 & SDMMC_R5_FUNCTION_NUMBER) == SDMMC_R5_FUNCTION_NUMBER)
    {
        return SDMMC_ERROR_INVALID_PARAMETER;
    }
    else if ((response_r1 & SDMMC_R5_OUT_OF_RANGE) == SDMMC_R5_OUT_OF_RANGE)
    {
        return SDMMC_ERROR_ADDR_OUT_OF_RANGE;
    }
    else
    {
        /* Nothing to do */
    }

    /* Should not get here, but this is needed to make the compiler happy */
    return SDMMC_ERROR_GENERAL_UNKNOWN_ERR;
}


/***************************************************************************************************
 * _stm32_sdio_cmd_rw_direct
 **************************************************************************************************/
static uint32_t _stm32_sdio_cmd_rw_direct(SDMMC_TypeDef* SDMMCx, uint32_t argument,
                                          uint32_t* response)
{
    SDMMC_CmdInitTypeDef sdmmc_cmdinit;
    uint32_t             errorstate;

    sdmmc_cmdinit.Argument         = argument;
    sdmmc_cmdinit.CmdIndex         = SDMMC_CMD_SDMMC_RW_DIRECT;
    sdmmc_cmdinit.Response         = SDMMC_RESPONSE_SHORT;
    sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
    sdmmc_cmdinit.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

    /* Check for error conditions */
    errorstate = _stm32_sdio_get_cmd_resp5(SDMMCx, SDMMC_CMD_SDMMC_RW_DIRECT, response, argument);
    return errorstate;
}


/***************************************************************************************************
 * _stm32_sdio_cmd_rw_extended
 **************************************************************************************************/
static uint32_t _stm32_sdio_cmd_rw_extended(SDMMC_TypeDef* SDMMCx, uint32_t argument,
                                            uint32_t* response)
{
    SDMMC_CmdInitTypeDef sdmmc_cmdinit;
    uint32_t             errorstate = 0;

    sdmmc_cmdinit.Argument         = argument;
    sdmmc_cmdinit.CmdIndex         = SDMMC_CMD_SDMMC_RW_EXTENDED;
    sdmmc_cmdinit.Response         = SDMMC_RESPONSE_SHORT;
    sdmmc_cmdinit.WaitForInterrupt = SDMMC_WAIT_NO;
    sdmmc_cmdinit.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(SDMMCx, &sdmmc_cmdinit);

    /* Check for error conditions */
    if (response != NULL)
    {
        errorstate = _stm32_sdio_get_cmd_resp5(SDMMCx, SDMMC_CMD_SDMMC_RW_EXTENDED, response,
                                               argument);
    }
    return errorstate;
}


#if defined(__cplusplus)
}
#endif

#endif /* defined(HAL_SDMMM_MODULE_ENABLED) */
